export const langOfCommerce = [
	"外国語科目第１学年配当科目フランス語",
	"外国語科目第１学年配当科目中国語",
	"外国語科目第１学年配当科目スペイン語",
	"外国語科目第１学年配当科目英語",
	"外国語科目第１学年配当科目ドイツ語",
];

export const langOfLaw = [
	"外国語科目必修英語（初級）",
	"外国語科目必修中国語（初級）",
	"外国語科目選択インテンシブ英語インテンシブ",
	"外国語科目必修フランス語（初級）",
	"外国語科目必修スペイン語（初級）",
	"外国語科目必修英語（中級）",
	"外国語科目選択インテンシブスペイン語インテンシブ",
	"外国語科目必修朝鮮語（初級）",
	"外国語科目必修ドイツ語（中級）",
	"外国語科目選択インテンシブロシア語インテンシブ",
	"外国語科目選択インテンシブ朝鮮語インテンシブ",
	"外国語科目必修朝鮮語（中級）",
	"外国語科目選択インテンシブドイツ語インテンシブ",
	"外国語科目選択インテンシブフランス語インテンシブ",
	"外国語科目必修ドイツ語（初級）",
	"外国語科目選択インテンシブ中国語インテンシブ",
	"外国語科目必修ロシア語（初級）",
	"外国語科目必修スペイン語（中級）",
	"外国語科目必修ロシア語（中級）",
	"外国語科目選択ドイツ語",
	"外国語科目必修アラビア語（初級）",
	"外国語科目必修中国語（中級）",
	"外国語科目選択ラテン語",
	"外国語科目選択ギリシャ語",
	"外国語科目選択ポルトガル語",
	"外国語科目必修フランス語（中級）",
];

export const langOfEconomics = [
	"外国語科目必修外国語Ⅰ（英語）",
	"外国語科目必修外国語Ⅱ（ドイツ語）",
	"外国語科目必修外国語Ⅱ（中国語）",
	"外国語科目選択必修外国語Ⅰ（英語）",
	"外国語科目選択選択外国語（Ａ）",
	"外国語科目必修外国語Ⅱ（スペイン語）",
	"外国語科目必修外国語Ⅱ（フランス語）",
];

export const langOfPEARL = [
	"外国語科目必修外国語Ⅱ（日本語インテンシブ）（１年春）（ＰＥＡＲＬ）",
	"外国語科目必修外国語Ⅱ（日本語インテンシブ）（１年秋）（ＰＥＡＲＬ）",
	"外国語科目選択選択外国語（日本語）（ＰＥＡＲＬ）",
	"外国語科目選択必修外国語Ⅰ（英語）（ＰＥＡＲＬ）",
	"外国語科目必修外国語Ⅰ（英語）（ＰＥＡＲＬ）",
	"外国語科目選択選択外国語（日本語インテンシブ）（１年春）（ＰＥＡＲＬ）",
	"外国語科目選択選択外国語（日本語インテンシブ）（１年秋）（ＰＥＡＲＬ）",
	"外国語科目必修外国語Ⅱ（ドイツ語）（ＰＥＡＲＬ）",
	"外国語科目必修外国語Ⅱ（フランス語）（ＰＥＡＲＬ）",
	"外国語科目必修外国語Ⅱ（中国語）（ＰＥＡＲＬ）",
	"外国語科目必修外国語Ⅱ（スペイン語）（ＰＥＡＲＬ）",
	"外国語科目必修外国語Ⅱ（日本語）（ＰＥＡＲＬ）",
];

export const langOfLetters = [
	"必修語学科目英語",
	"必修語学科目ドイツ語",
	"必修語学科目中国語",
	"必修語学科目スペイン語",
	"必修語学科目フランス語",
	"必修語学科目イタリア語",
	"必修語学科目ロシア語",
	"必修語学科目韓国語",
];

export const langOfScience = [
	"外国語科目フランス語",
	"外国語科目中国語",
	"外国語科目ロシア語",
	"外国語科目朝鮮語",
	"外国語科目英語",
	"外国語科目ドイツ語",
];

export const lang = [
	...langOfCommerce,
	...langOfLaw,
	...langOfEconomics,
	...langOfLetters,
	...langOfScience,
];

export const humanities = [
	"人文科学科目選択",
	"総合教育科目Ⅱ類（人文・社会科学系科目）講義科目",
	"総合教育科目Ⅱ類（人文・社会科学系科目）演習科目",
	"総合教育科目第１・２学年設置科目系列Ｘ（人文・社会・学際系列）",
	"総合教育科目選択必修（Ⅱ系）Ⅱ系　人文・社会系",
	"総合教育科目選択必修（Ⅱ系）Ⅱ系　人文・社会系（ＰＥＡＲＬ）",
	"総合教育科目人文科学系列",
	"総合教育科目社会科学系列",
];

export const nature = [
	"総合教育科目Ⅰ類（自然科学系科目）実験科目",
	"総合教育科目Ⅰ類（自然科学系科目）講義科目",
	"総合教育科目Ⅰ類（自然科学系科目）演習科目",
	"総合教育科目選択必修（Ⅰ系）Ⅰ系　自然・数理系",
	"総合教育科目選択必修（Ⅰ系）Ⅰ系　自然・数理系（生物・物理・化学）",
	"総合教育科目選択必修（Ⅰ系）Ⅰ系　自然・数理系（ＰＥＡＲＬ）",
	"総合教育科目自然科学系列",
];

export const pe = ["体育"];

export const other = [
	"総合教育科目系列外語学以外",
	"総合教育科目系列外教授会の認める",
	"基礎科目Ⅱ類（基礎選択科目）(18, 19学則) / 総合教育科目Ⅳ類（自主強化科目）数学系科目(05学則)",
	"総合教育科目選択必修（Ⅲ系）Ⅲ系　総合・関連系",
	"総合教育科目選択必修（Ⅲ系）Ⅲ系　総合・関連系（自由研究セミナー）",
	"総合教育科目選択必修（Ⅲ系）Ⅲ系　総合・関連系（自由研究セミナー）（ＰＥＡＲＬ）",
	"総合教育科目Ⅲ類（学際的・総合的科目）講義科目(18, 19学則) / 総合教育科目Ⅲ類（学際的・総合的科目）商学部設置講義科目(05学則)",
	"総合教育科目第１・２学年設置科目系列Ｙ（自然科学系列・総合教育セミナー・外国語）",
	"総合教育科目Ⅲ類（学際的・総合的科目）諸研究所設置少人数形式科目",
	"総合教育科目Ⅳ類（自主強化科目）情報処理系科目",
];

export const all = [...lang, ...humanities, ...nature, ...pe, ...other];
